/*
  Localizable.strings
  Patched Sur

  Ukrainian (uk)
  Created by NickP0is0n on 5/2/21.
*/

// MARK: Pre-Install App (96)
// Generic

"GET-STARTED" = "Розпочати";
"CONTINUE" = "Продовжити";
"GO-BACK" = "Назад";
"CANCEL" = "Скасувати";
"BROWSE" = "Огляд";
"REFRESH" = "Оновити";
"CONTINUE-ERASE" = "Продовжити та стерти";
"REQUEST-ROOT" = "Запит прав адміністратора";
"EXTRACT-PACKAGE" = "Розпакування пакету";
"FINISHED" = "Завершено";

// Enter Password Prompt
"B-ENTER-PASS-CHANGES" = "Patched Sur хоче внести зміни.";
"B-ENTER-PASS-ALLOW" = "Введіть свій пароль щоб дозволити.";
// The main difference here is
"B-EP-USERNAME" = "Користувач:";
// The only difference here is the colon, which sounds dumb, but it's needed.
"B-EP-PASSWORD" = "Пароль:";
"B-EP-PASSWORD-PH" = "Пароль";

// Welcome Page

// Reminder! "Patched Sur" is a formal name, so don't localize that. (Patches/Patcher can be localized, just not Patched Sur)
"PRE-WELCOME-TITLE" = "Ласкаво просимо до Patched Sur!";
"PRE-WELCOME-DESCRIPTION" = "Цей патчер був створений, щоб дати вам можливість найпростіше оновитися до macOS Big Sur на вашому непідтримуваному Mac. Він готує всі речі, необхідні для найкращої роботи системи, і стежить за тим, щоб з вашою інсталяцією нічого не сталося. В результаті Patched Sur дасть можливість вашому Mac працювати в тому ж вигляді, як і в підтримуваних.";

// Thanks To Page

"THANKS-TITLE" = "Подяки";
"THANKS-CONTENT" = "Patched Sur був розроблений не тільки мною (Ben), інші також брали участь в розробці патчеру та патчів, що допомогло створити його в тому вигляді, в якому він сьогодні!

- barrykn: Створив мікропатчер, який познайомив мене з процесом модифікації системи і повернув мені віру в мій старий комп'ютер. Знімаю капелюха перед barrykn, раджу вам зробити те ж саме.
- ASentientBot: Створив хеш-патчі для інсталятора і додав підтримку фреймбуферу GeForce Tesla (9400M / 320M) в Big Sur разом з патчами для роботи графічного прискорення відеокарт без підтримки Metal.
- jackluke: З'ясував, як оминути перевірку сумісності в USB інсталяторі.
- highvoltage12v: Розробив перші Wi-Fi кексти для Big Sur.
- ParrotGeek: Розробив кекст LegacyUSBInjector для роботи USB портів на деяких старих Mac та знайшов спосіб пропуску введення команд в Терміналі під час завантаження інсталятора.
- testheit: Допоміг з утилітою kmutil в мікропатчері (використовується і в Patched Sur)
- Ausdauersportler: Інтегрував патчі для підтримки Metal відеокарт в iMac.
- StarPlayrX: Вказав на утиліту startosinstall, яка в подальшому використовувалася в патчері для оновлень системи без використання USB.
- ASentientHedgehog: Допомагав рандомним чином протягом всього шляху.
- OCLP Team: Допоміг з речами на рівні ядра для не-Tesla відеокарт без підтримки Metal для досягнення апаратного прискорення.
- dosdude1: Заміна OpenGL/GPUSupport і величезна кількість речей, які використовуються для модифікації системи.
- Bweesh, Bruno Rocha, DutchDK, NickP0is0n, 8itCat, Finder352, DJT_233, Noah Fetz, duke4e, и riiveraluis за переклад додатку.
- John_val, fromeister2009, Mr. Macintosh, Emperor Epitaph, Finder352, Monkiey and 8itCat за тестування нових функцій до релізу та знаходження багів.
- і всім іншим, хто допоміг змусити Big Sur працювати настільки добре, як це зараз, на Mac, які не підтримуються.

Patched Sur використовує два фреймворка з відкритим першокодом, Files і ShellOut за авторством JohnSundell (ліцензія MIT), для вирішення деяких проблем.";

// Please Remember Page

"PLEASE-REMEMBER" = "Зверніть увагу";
"PRE-PR-1" = "Patched Sur знаходиться на етапі бета-тестування і ніколи не буде ідеальним. Хоч він й не призведе до поломки вашого Mac, ви можете втратити дані в процесі, якщо у вас немає резервної копії.";
"PRE-PR-2" = " Обов'язково зробіть копію даних за допомогою Time Machine! ";
"PRE-PR-3" = "Я і команда проекту не несемо відповідальності за втрати через діяльність програми. Я докладу всі зусилля, аби допомогти вирішити проблему, але я не знаю абсолютно всього і в деяких випадках не зможу допомогти. У більшості випадків, проблема криється не в Patched Sur, так що я тут нічого не зможу зробити.";

// Mac Compatibility Page

"PRE-VERIFY-MAC" = "Перевірка Mac";
"PRE-VERIFY-QUICK" = "Цей перший крок важливий, щоб зрозуміти, наскільки Patched Sur може бути використаний. Він допоможе визначити потенційні проблеми, з якими ви можете зіштовхнутися, зокрема відсутність FileVault, апаратного прискорення графіки та інші. Це не займе багато часу.";
"PRE-VERIFY-FETCH" = "Отримання інформації";
"PRE-VERIFY-2" = "Перевіряємо Mac";

"PRE-REPORT-BY" = "Повідомив: ";
"PERSON" = "особа";
"OTHERS" = "інші";
"APPROVES" = "схвалює";
"APPROVE" = "схвалюють";

"WiFi, Ethernet and Bluetooth" = "WiFi, Ethernet та Bluetooth";
"I/O Ports" = "Порти введення-виведення";
"Graphics Acceleration" = "Апаратне прискорення графіки";
"Sleep and Brightness" = "Режим сну й регулювання яскравості";
"FileVault" = "FileVault";
"Personal Hotspots" = "Точки доступу";
"Personal Hotspot" = "Точка доступу";
"WPA2 Enterprise" = "WPA2 Enterprise";

"PROB-FATAL" = "Виявлено критичну проблему";
"PROB-WARN" = "Виявлено можливу проблему";
"PROB-NO-UPGRADE" = "Через цю або іншу проблему ви не можете оновитися до Big Sur.";
"PROB-CONTINUE-ANYWAY" = "Все одно продовжити";
"PROB-OTHERS" = "Інші проблеми";

"PROB-FILE-TITLE" = "FileVault активовано.";
"PROB-FILE-DESCRIPTION" = "У вас активовано FileVault. Цей інструмент, незважаючи на свої переваги, призводить до відмови Big Sur на непідтримуваних Mac. Ви не зможете завантажитись в режим відновлення, і час від часу не зможете розблокувати диск. Ви повинні деактивувати FileVault перед використанням патчеру. Ви можете це зробити, зайшовши в Системні налаштування. Перейдіть в розділ Захист і конфіденційність, оберіть вкладку FileVault, натисніть на іконку замка та відключіть цю функцію.";

// Reminder! "BigMac" and "StarPlayrX" are a formal names, so don't localize that.
"PROB-PRO-TITLE" = "Існує більш придатний патчер для Mac Pro";
"PROB-PRO-DESCRIPTION" = "У той час, як Patched Sur підходить для більшості Mac, ви не повинні його використовувати з Mac Pro. Він не містить необхідних патчів, і для нього існує окремий патчер. Це BigMac Patcher від StarPlayrX, і він надасть найкращий досвід використання вашого Mac.";

"PROB-GX-TITLE" = "Відсутня підтримка апаратного прискорення графіки";
"PROB-GX-DESCRIPTION" = "Ваш Mac не підтримує технологію Metal, так що Big Sur буде працювати НЕЙМОВІРНО ПОВІЛЬНО. Не очікуйте від системи швидкості роботи, що підходить для будь-якого реального використання. Патч для вирішення цієї проблеми в розробці, але на даний момент він вкрай нестабільний. Якщо ви хочете продовжити, ваше право, але не чекайте, що ви магічно отримаєте повністю робочий Big Sur.";

"PROB-SURE" = "Ви дійсно хочете продовжити?";
"PROB-SURE-SURE" = "Patched Sur виявив проблеми, які можуть (і призведуть) до помилок в роботі Big Sur. Ваш Mac може працювати не в повну силу, і в деяких випадках краще залишитись на Catalina.";

"REPORT-UNKNOWN" = "Сумісність не визначено";
"REPORT-UNKNOWN-2" = "Залежно від вашого Mac, Patched Sur може працювати чи ні, Patched Sur не знайшов звіти про сумісність з вашою моделлю Mac, так що в даний момент працездатність невідома. Не хвилюйтеся, ще не дуже багато людей поділилися, як Patched Sur працює на різних Mac, так що швидше за все, ваш Mac буде працювати добре. Як тільки ви оновитесь, ви можете поділитись своїм досвідом (в меню Налаштувань після-інсталяційного додатку), і допомогти майбутнім користувачам вашої моделі Mac!";

// Update Track Page

"PRE-TRACK-TITLE" = "Встановити гілку оновлень";
"PRE-TRACK-DESCRIPTION" = "Ваша гілка оновлень визначає, які версії macOS ви отримаєте. Релізний гілка найстабільніша, і швидше за все, ви її вже використовуєте. Гілка Бета дає вам ранній доступ до нових функцій macOS, але вона час від часу нестабільна.";

"TRACK-RELEASE" = "Релізна гілка";
"TRACK-BETA" = "Гілка Бета";

// macOS Select Page

"PRE-VERS-TITLE" = "Версія macOS Big Sur";
"PRE-VERS-DESCRIPTION" = "Хоча в більшості випадків варто використовувати останню версію macOS Big Sur, якщо з якоїсь причини вам потрібна більш стара версія, ви можете налаштувати її тут. Якщо ви хочете використовувати заздалегідь завантажений InstallAssistant.pkg або повний інсталятор, ви можете натиснути кнопку Огляд. Якщо ви просто хочете завантажити і використати останню версію macOS, просто натисніть на кнопку Завантажити.";
"PRE-VERS-NOFI" = "Список інсталяторів macOS недоступний. Швидше за все, у вас відсутнє підключення до мережі. Ви повинні використовувати заздалегідь завантажений інсталятор.";
// NOTE: In these two, XX.YY.ZZ is the macOS version. So in English, the first would show Download macOS 11.3. \(installers[0].version)
"PRE-VERS-DOWNLOAD" = "Завантажити macOS XX.YY.ZZ";
"PRE-VERS-USE" = "Використати macOS XX.YY.ZZ";
"PRE-VERS-PRE" = "Використати існуючу копію macOS";
"PRE-VERS-REDOWNLOAD" = "Завантажити знову";
"PRE-VERS-FETCH" = "Отримання списку інсталяторів";

// Downloading Kexts Page

"DOWNLOAD-PATCHES" = "Завантаження патчів";
"DOWNLOAD-FILES" = "Завантаження файлів";
"PRE-DP-1" = "Утиліта для встановлення змінних дозволяє вам правильно налаштувати NVRAM й статус SIP, щоб Big Sur нормально завантажувався.";
"PRE-DP-2" = "Це останній інструмент, який ви будете використовувати перед встановленням Big Sur.";
"PRE-DP-3" = "Вам це буде необхідно, якщо ви раніше не використовували її на цьому Mac або скинули PRAM.";
"PRE-DP-4" = "Патчі кекстов дозволяють додати підтримку вбудованого обладнання, наприклад Wi-Fi модуля та USB портів, щоб ваш Mac залишався повністю функціональним.";
"PRE-DP-CANCEL-1" = "Патчі на даний момент завантажуються. Ви дійсно хочете повернутися?";
"PRE-DP-CANCEL-2" = "Патчі завантажуються";
"CANCEL-DOWNLOAD" = "Скасувати завантаження";
"RESTART-DOWNLOAD" = "Розпочати завантаження ще раз";
"CONTINUE-DOWNLOAD" = "Продовжити завантаження";
"PRE-DP-CANCEL-3" = "Сталася помилка під час завантаження патчів, ви можете спробувати вирішити проблему, розпочавши завантаження ще раз. Ви хочете спробувати завантажити патчі ще раз або перейти до попереднього кроку?";
"PRE-DP-CANCEL-4" = "Ви дійсно хочете розпочати завантаження ще раз?";

// Downloading macOS Page

"PRE-DM-TITLE" = "Завантаження macOS";
"PRE-DM-DESCRIPTION" = "На даний момент macOS скачується безпосередньо з серверів Apple, в подальшому інсталятор буде розпакований на USB носій. Це повний інсталятор, тому він важить 12 ГБ. Це займе деякий час, тому дочекайтеся закінчення процесу і переконайтеся, що у вас стабільне інтернет-з'єднання. Після цього, вам необхідно обрати USB носій для розпаковки на нього інсталятора, Patched Sur використовує цей файл, щоб створити інсталяційну флешку.";
"PRE-DM-BAR" = "Завантаження macOS XX.YY.ZZ";
"PRE-DM-CANCEL-1" = "На даний момент macOS скачується безпосередньо з серверів Apple щоб його можна було в подальшому використовувати. Це великий файл. Ви дійсно хочете повернутися?";
"PRE-DM-CANCEL-2" = "macOS завантажується";
"PRE-DM-CANCEL-3" = "Сталася помилка під час завантаження macOS, ви можете спробувати вирішити проблему, почавши завантаження заново. Ви хочете спробувати завантажити macOS ще раз або перейти до попереднього кроку?";

// Select Volume Page

"PRE-VOL-TITLE" = "Оберіть USB накопичувач";
"PRE-VOL-1" = "Щоб встановити пропатченний Big Sur, вам необхідний USB інсталятор, який проведе вас через процес оновлення. Він забезпечить середу, в якій патчер може бути впевнений, що все встановиться правильно.";
"PRE-VOL-2" = "Щоб створити інсталятор, вам потрібен флеш-накопичувач.";
"PRE-VOL-3" = "Цей USB повинен бути обсягом не менше 16 ГБ. Внутрішні розділи не працюватимуть, однак зовнішні, в залежності від схеми розмітки (яка швидше за все буде правильною, якщо це GUID). Якщо ваша флешка не відображається, переконайтеся, що вона відформатована в файлової системі MacOS Extended (Журнальна).";
"PRE-VOL-NO" = "Сумісні пристрої не виявлені.";
// Note: VOLUME is the volume name, do not localize it, just pretend it's a volume name and just place it into your sentence
// Ex. If the volume was "SuperDrive", then "VOLUME will be erased." would show up as "SuperDrive will be erased."
"PRE-VOL-ERASED" = "VOLUME буде очищений.";
"PRE-VOL-ERASED-2" = "Всі файли на цьому розділі будуть повністю стерті. Ця дія є незворотньою. Ви дійсно хочете продовжити?";
"PRE-VOL-DETECTING" = "Пошук пристроїв";
"PRE-VOL-CHECKING" = "Перевірка тому VOLUME";

// Create Installer Page

"PRE-CTI-TITLE" = "Створення USB інсталятора";
"PRE-CTI-DESCRIPTION" = "Тепер носій, який ви обрали, буде використаний, як інсталяційна флешка macOS. Файли, скопійовані на диск, створять середу, аналогічну режиму відновлення macOS Big Sur. Як тільки файли будуть перенесені на USB, Patched Sur пропатчить їх, щоб дозволити вашому Mac завантажитися з флешки та додасть туди корисні утиліти для непідтримуваних Mac.";
"PRE-CTI-CANCEL-1" = "Ви дійсно хочете скасувати створення пропатченого інсталятора macOS? Він вам знадобиться, щоб оновитися до macOS Big Sur, і частіше за все процес створення займає багато часу.";
"PRE-CTI-CANCEL-2" = "Інсталятор macOS в процесі створення";
"CANCEL-PROCESS" = "Скасувати процес";
"RESTART-PROCESS" = "Перезапустити процес";
"CONTINUE-PROCESS" = "Продовжити процес";
"PRE-CTI-CANCEL-3" = "Помилка під час створення інсталяційного носія macOS, ви можете спробувати вирішити проблему, розпочавши заново.";
"PRE-CTI-CANCEL-4" = "Ви хочете спробувати знову?";
"PRE-CTI-CREATING" = "Створення інсталятора";

// Done Page
"PRE-DONE-INFO" = "Ви майже готові почати оновлення до Big Sur. Інсталяційний USB успішно створений і прийшов час невеликої ручної роботи. Якщо у вас немає можливості безпосередньо дивитися на пункти, запишіть дані кроки (вони дійсно прості, хоч і здається, що їх багато):

1. Перезавантажте ваш Mac, затиснувши кнопку option (Alt), поки ви не побачите іконки дисків.
2. Оберіть жовтий або фіолетовий пункт EFI Boot. Це одразу перезавантажить ваш комп'ютер.
3. Увімкніть знову ваш Mac, затиснувши кнопку option (Alt).
4. Оберіть Install macOS Big Sur.
5. Як тільки ваш Mac завантажитися, оберіть пункт (Пере)встановити macOS Big Sur. (Це може так звучати, але це не зітре ваші дані, інсталятор просто оновить ваші системні файли).
6. Як тільки додаток відкриється, оберіть у ньому ваш розділ (швидше за все Macintosh HD, але НЕ Install macOS Big Sur)
7. Після того, як оновлення закінчиться і ви увійдете в систему, відкрийте папку Програми та запустіть Patched Sur.
8. Натисніть на Пропатчити кексти, потім натисніть Продовжити і введіть свій пароль.
9. Після цього перезавантажте ваш Mac і насолоджуйтеся повністю робочою системою Big Sur!";
// I suggest adding "However, these are only in English." to the end of this, since the linked page is only in English.
"PRE-DONE-LINK" = "Ви можете також знайти ці кроки на GitHub (тільки англійською мовою).";
"PRE-DONE-STEPS" = "(Кроки 10-14)";

// MARK: Post-Install App (96)

// General

"BACK" = "Назад";
"RESTART-TO-FINISH" = "Перезавантажте для закінчення";

// MARK: Menu Bar

"PO-MN-ABOUT-PATCHER" = "Про Patched Sur";
"PREFERENCES" = "Налаштування";
"PO-AMM-TITLE" = "Про цей Mac";
"PO-MN-HELP" = "Довідка Patched Sur";
"PO-MN-HELP-OS" = "Оновлення macOS";
"PO-MN-HELP-PATCHER" = "Оновлення патчеру";

// MARK: Update Notifications

// VERSIONTAG is the version number of the new patcher/macOS version (like 0.3.1 or 11.3.1).
"PO-NOFI-SELF" = "Наявне оновлення Patched Sur до версії VERSIONTAG. Відчиніть Patched Sur і натисніть Оновитись щоб дізнатися більше.";
"PO-NOFI-OS-TITLE" = "Оновлення ПЗ";
"PO-NOFI-OS-DESCRIPTION" = "macOS Big Sur версії VERSIONTAG може бути встановлено. Відкрийте Patched Sur і натисніть Оновити macOS щоб дізнатись більше.";

// MARK: About Patched Sur

// APPBUILD is the app's version build number, like "96".
"PO-ATP-AUTHOR-BUILD" = "Автор: Ben Sova • Збірка APPBUILD";
"PO-ATP-DESCRIPTION" = "Простий патчер з великим ядром, що спрощує запуск Big Sur на непідтримуваному Mac, розроблений для всіх.";
"PO-ATP-WHATS-NEW-QUESTION" = "Що нового в 1.0.0?";
"PO-ATP-WHATS-NEW-ANSWER" = "Він буде швидше, потужніше, і більш зрозумілим для всіх, навіть якщо ви без Metal або без знань англійської.";

// MARK: Central View

"PO-UP-TITLE" = "Оновитись";
"PO-UP-DESCRIPTION" = "Оновити macOS або патчер до нової версії.";
"PO-PK-TITLE" = "Пропатчити кексти";
"PO-PK-DESCRIPTION" = "Пропатченні кексти дозволяють macOS повністю працювати на нерідному Mac.";
"PO-ST-TITLE" = "Налаштування";
"PO-ST-DESCRIPTION" = "Відключення анімації, активація перемикання графіки, логи та інше.";
"PO-CI-TITLE" = "Створити інсталятор";
"PO-CI-DESCRIPTION" = "Створення пропатченної інсталяційної флешки macOS Big Sur.";
"PO-IR-TITLE" = "Режим відновлення";
"PO-IR-DESCRIPTION" = "Встановлення патчів розділу відновлення (доступний через CMD-R при завантаженні).";
"PO-AMM-DESCRIPTION" = "Показати коротку інформацію про ваш Mac без серійного номера.";

"PO-PK-NO-NEED-TITLE" = "Ваш Mac не потребує патчів";
"PO-PK-NO-NEED-DESCRIPTION" = "Вам не потрібно патчити кексти на iMac кінця 2013 року. Big Sur без них буде працювати повноцінно.";

// MARK: Settings View

"PO-ST-TITLE-ALT" = "Додаткові налаштування";
"PO-ST-SUBTITLE" = "Різні корисні інструменти/патчі";
"PO-ST-SECTION-1" = "Додаткові патчі";
"PO-ST-SECTION-2" = "Додаткові інструменти";
"PO-ST-RESTART-APPLY" = "Після перезавантаження Mac зміни будуть застосовані.";

"PO-ST-DA-DISABLE" = "Вимкнути анімації";
"ENABLE" = "Увімкнути";
"PO-ST-DA-DISABLE-DONE" = "Анімації вимкнуті!";
"PO-ST-DA-DISABLE-DONE-2" = "Після перезавантаження Mac зміни будуть застосовані і Big Sur буде працювати швидше.";
"PO-ST-DA-ENABLE-DONE" = "Анімації увімкнуті!";
"PO-ST-DA-DESCRIPTION" = "Вимкнення анімації буде корисно для Mac без підтримки Metal. Оскільки у них відсутнє апаратне прискорення графіки, Big Sur буде працювати дуже повільно, так що вимкнення анімацій дозволить трохи прискорити роботу системи.";

"PO-ST-GXS-ENABLE" = "Увімкнути перемикання графіки";
"DISABLE" = "Вимкнути";
"PO-ST-GXS-DESCRIPTION" = "Якщо у вас Mac з декількома відеокартами, тоді ви, ймовірно, захочете увімкнути автоматичне перемикання графіки. Дякую @15wat за дане рішення.";
"PO-ST-GXS-ENABLE-DONE" = "Перемикання графіки увімкнено!";
"PO-ST-GXS-ENABLE-DONE-2" = "Тепер графіка буде перемикатися автоматично! Можливо буде потрібно перезавантаження, щоб зміни набули чинності.";
"PO-ST-GXS-ENABLE-FAILED" = "Помилка при активації перемикання графіки";
"PO-ST-GXS-DISABLE-DONE" = "Перемикання графіки вимкнено!";
"PO-ST-GXS-DISABLE-DONE-2" = "Тепер графіка не буде перемикатися автоматично! Можливо буде потрібно перезавантаження, щоб зміни набули чинності.";
"PO-ST-GXS-ENABLE-FAILED" = "Помилка при деактивації перемикання графіки";

"PO-ST-PKL-BUTTON" = "Показати логи патчінгу кекстов";
"PO-ST-PKL-DESCRIPTION" = "Якщо у вас проблеми з патчінгом кекстов, можливо варто пошукати помилки в логах. Це може допомогти комусь, хто намагається допомогти вам розібратися в проблемі, тому, якщо ви можете, надайте це всім, хто намагається вам допомогти.";
"PO-ST-PKL-TITLE" = "Логи патчингу кекстів";
"PO-ST-PKL-NO-LOGS" = "Логи відсутні";
"PO-ST-PKL-COPIED" = "Скопійовано!";
"PO-ST-PKL-COPIED-2" = "Останні логи були скопійовані в буфері обміну. Це може допомогти з відладкою, не забудьте надати це всім, хто намагається вам допомогти.";

"PO-ST-CL-TITLE" = "Очистити сміття Patched Sur";
"PO-ST-CL-DESCRIPTION" = "Іноді, Patched Sur може залишати деяке сміття під час роботи. Це може звільнити до 12 ГБ, рекомендується використовувати після оновлень через патчер.";
"PO-ST-CL-DONE" = "Сміття видалено";
"PO-ST-CL-DONE-2" = "Файли було видалено, у вас повинно з'явитися трохи вільного місця (за умови, що дійсно існували великі файли, які потрібно було очистити).";

"PO-ST-CYE-TITLE" = "Поділитися своїм досвідом";
// Add a translation for 'Please Note: These reports are only accepted in English.' to this next value
"PO-ST-CYE-DESCRIPTION" = "У Patched Sur є функція, що дозволяє новим користувачам дізнатися, наскільки добре їх Mac буде працювати з Big Sur. Однак для чогось подібного потрібна інформація, і в цьому ви можете допомогти! Просто натисніть на посилання вище і дотримуйтесь інструкцій, щоб допомогти. Зверніть увагу: звіти приймаються виключно англійською мовою!";

"PO-ST-RL-TITLE" = "Перезавантажити патчер";
"PO-ST-RL-DESCRIPTION" = "Я не знаю, навіщо вам це потрібно, але якщо ви захочете, ви можете перезапустити патчер. Це скине безліч змінних, що встановлюються під час запуску патчером, і ще багато чого. Цікавий факт: це той самий код, який запускається після завершення оновлення.";
"PO-ST-RL-FAILED" = "Помилка при перезавантаженні!";
"PO-ST-RL-FAILED-2" = "Не вдалося відкрити Patched Sur, але ви можете це зробити вручну.";

// MARK: Patch Kexts Page

"PO-PK-TITLE-ALT" = "Відновити кексти";
"PO-PK-SUBTITLE" = "Відновлення оригінальних драйверів";
"PO-PK-DESCRIPTION-2" = "Після того, як ви пропатчите ваші кексти, ви отримаєте робочий Wi-Fi модуль, USB та багато інших речей на вашому Big Sur. Без цих кекстів ваш Mac не буде працювати в повній мірі на Big Sur. Якщо вам необхідно, ви можете видалити патчі кекстів, а потім повторно їх застосувати, це може допомогти вирішити проблему.";
"PO-PK-START" = "Розпочати патчінг кекстів";
"PO-PK-UN-START" = "Розпочати відновлення кекстів";
"PO-PK-INSTEAD" = "Замість цього відновити кексти";
"PO-PK-INSTEAD-REVERSE" = "Замість цього пропатчити кексти";
"PO-PK-DETECT" = "Пошук патчів";
"PO-PK-NONE-DETECTED" = "Патчів не виявлено";
"PO-PK-NONE-HELP" = "Спробуйте вставити пропатченну інсталяційну флешку";
"PO-PK-RUNNING" = "Патчінг кекстів";
"PO-PK-UN-RUNNING" = "Відновлення кекстів";
"PO-PK-LEGACY-ALERT" = "Патчі вимагають включений режим Legacy";

// MARK: Create Installer Others

"PO-CI-START-TITLE" = "Створити інсталятор macOS";
"PO-CI-START-DESCRIPTION" = "Цей інструмент дозволяє вам створити пропатченний інсталятор macOS Big Sur на USB-накопичувачі, аналогічно тому, як це робить додаток попередньої установки, за винятком декількох змін. Це можна використовувати, якщо ви зіткнетеся з проблемою з патчером. Зверніть увагу, що ви можете встановити розділ відновлення, який дуже схожий на цей, проте в даний час за допомогою нього неможливо перевстановити macOS, так як при відновленні немає Wi-Fi. Також зверніть увагу, що якщо ви використовуєте це для оновлення, є більш простий спосіб - післяінсталяційний додаток.";
"PO-CI-FINISHED-TITLE" = "Інсталятор macOS створено";
"PO-CI-FINSIHED-DESCRIPTION" = "Тепер цей інсталятор можна використовувати для будь-яких цілей. Він повністю пропатчений і містить установник macOS (сподіваюся, ви це знаєте), середу режиму відновлення і, звичайно ж, Patched Sur для патчінга кекстів.";

// MARK: About This Mac

"PO-AMM-MODEL" = "Модель";
"PO-AMM-PROCESSOR" = "Процесор";
"PO-AMM-GRAPHICS" = "Графіка";
"PO-AMM-MEMORY" = "Пам'ять";
"PO-AMM-BACK" = "Повернутися в головне меню";
"PO-AMM-UPDATE" = "Оновлення ПЗ...";
"PO-AMM-VERSION" = "Версія";

// MARK: Update Status

"PO-UP-CHECKING" = "Перевірка оновлень";
"PO-UP-CHECK-FAILED" = "Не вдалося перевірити оновлення";
"PO-UP-CHECK-FAILED-1" = "Це, ймовірно, означає, що або ваше інтернет-з'єднання не працює, або сервера веб-хостингу GitHub не працюють. Це не повинно бути проблемою, ви можете оновити macOS вручну за допомогою Patched Sur або оновити сам патчер, завантаживши його зі сторінки Patched Sur на GitHub.";
"PO-UP-TITLE-PATCHER" = "Оновлення патчеру";
"PO-UP-TITLE-MACOS" = "Оновлення macOS";

"PO-UP-USING-TRACK" = "Ви використовуєте гілку оновлень";
// Imagine that this is like a sentence. First you see the above phrase, then Release or Beta, then the next text.
// So this would read, "You are using the Release update track"
"PO-UP-USING-TRACK-2" = ".";
"PO-UP-BETA-DESCRIPTION" = "Ці оновлення можуть бути нестабільними і не завжди рекомендуються для повсякденного використання.";
"PO-UP-RELEASE-DESCRIPTION" = "Ці оновлення зазвичай більш стабільні, дана гілка використовується за промовчанням.";
"PO-UP-IS-AVALIBLE" = "Доступно оновлення!";
"RELEASED" = "Випущено";
"BUILD" = "Збірка";
"PO-UP-VIEW-OTHER" = "Подивитись інші версії";
"PO-UP-START-TITLE" = "Розпочати оновлення macOS";
"PO-UP-START-DESCRIPTION" = "Для оновлення патчер спочатку завантажить останні патчі, а потім нову версію macOS безпосередньо з серверів Apple, після чого програма оновлення Apple буде запущена без перевірки сумісності.";
"PO-UP-NOTES-TITLE" = "Останні зміни";
"PO-UP-NOTES-DESCRIPTION" = "Подивіться, що нового в macOS перед оновленням. Дякую Mr. Macintosh (або Apple/9to5Mac) за надання цієї інформації.";
"PO-UP-NO-UPDATES" = "Оновлення не знайдені.";
"PO-UP-YOU-ON" = "Ваша поточна версія: XX.YY.ZZ.";
"PO-UP-NOTIF-TITLE" = "Налаштувати сповіщення про оновлення";
"PO-UP-NOTIF-DESCRIPTION" = "Отримуйте сповіщення про оновлення macOS і патчеру.";

"PO-UP-NOTIF-TITLE-2" = "Сповіщення про оновлення";
// In case you don't know, /n means line down. So if I wrote Hello\nWorld, it would show up as:
// Hello
// World
"PO-UP-NOTIF-DESCRIPTION-2" = "Оскільки ваш Mac не підтримується, вбудоване ПО ніколи не буде інформувати вас про оновлення macOS, оскільки в ньому немає нічого нового, що підтримувало б ваш Mac. Проте, Patched Sur може сам надавати сповіщення про оновлення, якщо хочете.\n\nОтримувати сповіщення про:";
"NO" = "Ні";
"YES" = "Так";
"CONFIRM" = "Підтвердити";
"PO-NOTIF-SETUP-DONE" = "Налаштування сповіщень завершено!";
"PO-NOTIF-SETUP-DONE-2" = "Patched Sur буде повідомляти вас про оновлення на основі ваших нових налаштувань.";
"PO-NOTIF-SETUP-PERMS" = "Patched Sur потрібен дозвіл на відправку сповіщень.";
"PO-NOTIF-SETUP-PERMS-2" = "Перш ніж патчер зможе відправляти повідомлення про доступні оновлення, йому потрібен дозвіл на відправку сповіщень.";
"PO-NOTIF-SETUP-ALMOST" = "Майже готово!";
"PO-NOTIF-SETUP-ALMOST-2" = "Щоб завершити настройку повідомлень, Patched Sur створить користувацький демон, який буде перевіряти їх час від часу. Щоб створити його, патчер повинен мати root-доступ, тому вам буде запропоновано ввести пароль, після чого все буде готово!";
"PO-NOTIF-SETUP-DENY" = "Patched Sur не може відправляти сповіщення";
"PO-NOTIF-SETUP-DENY-2" = "Ви заборонили Patched Sur відправляти сповіщення. Якщо ви хочете дозволити Patched Sur відправляти сповіщення, відкрийте Системні налаштування > Сповіщення > Patched Sur, потім дозвольте сповіщення.";
"PO-NOTIF-SETUP-FAILED" = "Помилка при налаштуванні демона";

"PO-UP-COMPAT-FAIL-SIP" = "Не вдалося перевірити статус SIP";
"PO-UP-COMPAT-FAIL-SIP-2" = "Patched Sur не зміг перевірити ваш статус SIP.";
"PO-UP-COMPAT-SIP-ON" = "SIP увімкнуто";
"PO-UP-COMPAT-SIP-ON-2" = "Оскільки інсталятор перевіряє, чи підтримує оновлення ваш Mac, Patched Sur необхідно в нього додати dylib, щоб установник не перевіряв сумісність. Однак це можна зробити тільки з вимкненим SIP, тому Patched Sur необхідно, щоб ви вимкнули SIP, перш ніж продовжити. Щоб це зробити:

1. Завантажтеся в режим відновлення (⌘R під час запуску)
2. Відкрийте Термінал в меню Утиліти.
3. Пропишіть: csrutil disable та натисніть Enter.
4. Натисніть Enter і перезавантажте ваш комп'ютер, потім знову запустіть Patched Sur.";
"PO-UP-COMPAT-LV-ON" = "Валідацію бібліотек увімкнено";
"PO-UP-COMPAT-LV-ON-2" = "Валідація бібліотек не дозволяє Patched Sur модифікувати код інсталятора macOS і пропустити перевірку сумісності. Якщо ви хочете оновити macOS, вам необхідно спочатку відключити валідацію бібліотек.";

"SKIP" = "Пропустити";
"PO-UP-APP-FAILED" = "Завантаження не вдалось";
"PO-UP-APP-START" = "Завантаження оновлення";
"DOWNLOADING" = "Завантажується";

// MARK: Update Chooser

"PO-UP-CHOOSE-TITLE" = "Вибір оновлень";
"PO-UP-CHOOSE-FAILED" = "Виникла помилка під час отримання доступних оновлень.";
"PO-UP-CHOOSE-PRE" = "Цю версію macOS вже завантажено:";
"PO-UP-CHOOSE-CAN" = "Ви можете завантажити ці версії macOS:";
"PO-UP-CHOOSE-DELETE" = "Ви дійсно хочете видалити завантажений інсталятор?";
"PO-UP-CHOOSE-DELETE-2" = "При тому, що це звільнить 12.2 ГБ місця, він може бути корисний для швидкого перевстановлення macOS або з якоїсь іншої причини, з якої вам може знадобитися інсталятор macOS на 12 ГБ.";
"DELETE" = "Видалити";
"UPDATE" = "Оновити";
"REINSTALL" = "Перевстановити";
"UNEXPECTED-ERROR" = "Виникла помилка";
"PO-UP-CHOOSE-EXACT-PATH" = "Цей файл відсутній, неможливо визначити повний шлях. Ви не можете використовувати попередньо завантажений інсталятор.";
"PO-UP-CHOOSE-DOWNLOAD" = "Завантаження інсталятора macOS";
"PO-UP-CHOOSE-DOWNLOAD-1" = "Ви можете оновити операційну систему до цієї версії macOS, але ви також можете завантажити її, і це робить кнопка, яку ви натиснули. Це спливаюче вікно існує тільки для того, щоб ви це знали. (Це просто відкриє ваш веб-браузер і завантажить установник, нічого особливого.)";
"PO-UP-CHOOSE-DOWNLOAD-2" = "Ви не можете \"оновитись\" до більш старої версії macOS, але ви можете завантажити її, і це робить кнопка, яку ви натиснули. Це спливаюче вікно існує тільки для того, щоб ви це знали. (Це просто відкриє ваш веб-браузер і завантажить установник, нічого особливого.)";
"PO-UP-CHOOSE-DOWNLOAD-TIP" = "Ви також можете завантажити InstallAssistant.pkg, якщо хочете.";
"PO-UP-CHOOSE-DOWNLOAD-TIP-2" = "Ви не можете оновитися до більш старої версії macOS, але ви можете завантажити інсталятор, якщо хочете.";
"DOWNLOAD" = "Завантажити";

// MARK: Download Patches/macOS

"DOWNLOAD-PATCH-MACOS" = "Завантаження патчів і macOS";
"DOWNLOADED-PATCHES" = "Завантаження патчів";
"PO-UP-DPM-DESCRIPTION" = "Патчі дозволяють використовувати обладнання, таке як Wi-Fi модуль, і перезаписують код інсталятора, щоб ваш Mac залишався повністю функціональним. macOS завантажується безпосередньо з серверів Apple у вигляді файлу InstallAssistant.pkg. Звідти ми можемо витягти додаток інсталятора, а потім розпочати встановлення macOS. (Іноді індикатор виконання не працює, але завантаження при цьому йде.)";
"DOWNLOADING-MACOS" = "Завантаження macOS";

// MARK: Starting OS Installer

"PO-UP-SOI-TITLE" = "Готовий до оновлення!";
"PO-UP-SOI-DESCRIPTION" = "Тепер, Patched Sur завершить підготовку до оновлення й перезавантажить Mac в інсталятор оновлень macOS. Через деякий час інсталяцію macOS буде завершено, і ви зможете пропатчити кексти, а потім насолоджуватися macOS. Це займе деякий час! Так само, як і підготовка до оновлення в системних налаштуваннях, це не найшвидша річ в світі.";
"PO-UP-SOI-PREPARING" = "Підготовка до оновлення";

// MARK: Recovery Patch

"PO-IR-SUBTITLE" = "Корисне";
"DISCLAMIER" = "ДИСКЛЕЙМЕР";
"PO-IR-DISCLAIM" = "Це НЕ ТА РІЧ, на яку можна покладатися на 100%. В основному це просто \"тримайте, це найкраще, що можна тут зробити\". Я намагався створити режим відновлення мрії, але це не спрацювало, в основному тому, що прошивка на вашому Mac ігнорує файли, які на її думку існують без будь-якої причини. Якби ці файли не ігнорувалися, мені б не довелося робити це повідомлення. Однак ви можете робити такі речі в режимі відновлення: управляти значеннями NVRAM (наприклад, статусом SIP та аргументами завантаження), використовувати Дискову утиліту, переглядати веб-сторінки (напевно?), а також патчити/відновлювати кексти (і, можливо, деякі інші речі).
Я раджу створити інсталяційний USB і користуватися ним.
Ви не можете перевстановити macOS через режим відновлення.";
"PO-IR-SIP-ON" = "SIP увімкнено";
"PO-IR-SIP-ON-DESCRIPTION" = "Патч режиму відновлення не може бути встановлений при увімкненому SIP через захист файлової системи. Може здатися, що єдиний спосіб вимкнути SIP - це режим відновлення, але є й інші способи.\n\nЯкщо у вас все ще є установчий USB-накопичувач, можливо, ви зможете завантажитися в EFI Boot на ньому. Якщо це не спрацює або ви не можете цього зробити, завантажте комп'ютер в режим відновлення через Інтернет (CMD-OPTION-R під час завантаження), і ви зможете зробити це звідти.";
"PO-IR-PATCHING" = "Патчінг режиму восстановления";
"PO-IR-PATCHING-DESCRIPTION" = "Режим відновлення macOS на вашому Mac буде пропатчений. Цей процес складається з двох етапів: перший - це завантаження двох необхідних файлів, а другий - їх встановлення. Це дуже просто і не займає багато часу. Як тільки це буде зроблено, відновлення macOS буде розблоковано. Зверніть увагу, що якщо у вас кілька розділів, відновлення з основного диску буде (швидше за все) переважним і буде завантажуватися замість інших встановлених засобів відновлення.";
"PO-IR-DOWNLOAD-RECOVERY" = "Завантаження файлів режиму відновлення";
"PO-IR-DONE" = "Режим відновлення пропатчено!";
"GO-HOME" = "У головне меню";

// MARK: Three v1.0.0 (102)

// Friends in Settings
// Yes I'm adding this lol - duke4e advertised Patched Sur so I have to get him back and then I decided to add macOSicons.com because I like them. Maybe I'll have more friends later.
"PO-ST-FRIENDS" = "Друзі Patched Sur";
"PO-ST-FRIENDS-WIDGY" = "Widgy - відмінний додаток для створення повністю кастомних віджетів для iOS і macOS! З його допомогою ви можете заповнити свій пристрій всіма даними, які вам потрібні, розташувати їх так, як ви хочете, і при цьому вони будуть красиво поєднуватись з іншою частиною вашого домашнього екрану/робочого столу. Досить круто, правда?";
"PO-ST-FRIENDS-ICONS" = "macOSicons.com - це веб-сайт, що містить понад 5000 альтернативних іконок для macOS Big Sur. Ви можете завантажити іконки звідти, щоб замінити значки, які не вписуються в стиль Big Sur, або просто тому, що їх дизайн вам подобається більше, ніж оригінальний дизайн додатку.";

// MARK: Patch Kexts Configuration

"PO-PK-CONFIGURE" = "Розширені налаштування";
"PO-PK-CONFIG-WARN" = "УВАГА: Розширені налаштування слід використовувати тільки в тому випадку, якщо ви знаєте, що робите!
Не вмикайте непотрібні патчі.";
// This will come right before a button that toggles between "Patch Kexts" and "Unpatch Kexts"
"PO-PK-CONFIG-MODE" = "Режим:";
"PO-PK-CONFIG-UNPATCH" = "Всі патчі будуть видалені, і система буде відновлена до початкового стану без них. WiFi і частина інших компонентів перестане працювати. Це може зіпсувати ядро системи, що призведе або до kernel panic, або до неможливості патчінга кекстов, тому, як правило, безпечніше просто перевстановити macOS, а не видаляти патчі.";
"ENABLED" = "Увімкнено";
"DISABLED" = "Вимкнено";

// MARK: Boot.plist Settings

"PO-ST-BOOT" = "Патч Boot.plist";
"PO-ST-BOOT-DONE" = "Boot.plist вже пропатчено";
"PO-ST-BOOT-DESCRIPTION" = "Патч com.apple.Boot.plist дозволить скидати NVRAM на вашому Mac без необхідності USB інсталятора і EFI Boot. Після цього вам доведеться відновити NVRAM (Patched Sur допоможе), так як вам краще мати значення, ніж не мати його. Вам доведеться патчити цей plist кожен раз при оновленні macOS.";
"PO-ST-BOOT-ONGOING" = "Патчинг Boot.plist у процесі";
"PO-ST-BOOT-NONE" = "Сумісних патчів не виявлено.
Можливо, у вас не завантажено останню версію патчів, які необхідні для файлу boot.plist.
Використовуйте «Оновити резервні патчі», щоб оновити їх, потім спробуйте ще раз.";

// MARK: Volume Selection

"PRE-VOL-INCOMPAT" = "Показати несумісні диски";
"PRE-VOL-INCOMPAT-TITLE" = "Несумісні диски";
"PRE-VOL-INCOMPAT-NODATA" = "Неможливо знайти інформацію про диск, це може бути баг патчера.";
"PRE-VOL-INCOMPAT-INTERNAL" = "Внутрішній носій, використовуйте замість нього зовнішній USB.";
"PRE-VOL-INCOMPAT-IMAGE" = "Образи дисків не можуть бути завантажувальними, використовуйте зовнішній USB.";
// For these next two, I suggest checking Disk Utility for the proper terms for GUID Partition Map and MacOS Extended (Journaled).
"PRE-VOL-INCOMPAT-GUID" = "Не відформатовано з таблицею розділів GUID";
"PRE-VOL-INCOMPAT-SYNTH" = "Цей диск відформатовано як APFS, використовуйте Mac OS Extended (журнальована)";

// MARK: NVRAM Reset Wanring

"PO-NV-POPUP-TITLE" = "Необхідне значення NVRAM відсутнє";
"PO-NV-POPUP-DESCRIPTION" = "Відсутній аргумент запуску -no_compat_check. Хоча Patched Sur вже захистив вас від найбільшої проблеми, викликаної цим, є і інші проблеми, які можуть виникнути в результаті цього.";
"PO-NV-POPUP-START" = "Переглянути інструкції";
"PO-NV-POPUP-DESCRIPTION-TWO" = "Запустіть Patched Sur (пост-інсталяційний додаток, не той, що в dmg) щоб дізнатися більше і побачити, як відновити це значення.";
"PO-NV-POPUP-DESCRIPTION-THREE" = "Натисніть Переглянути інструкції нижче, щоб дізнатися, як відновити значення.";
"PO-NV-CHECK-TITLE" = "У вас наявний пропатченний інсталяційний USB?";
"PO-NV-CHECK-DESCRIPTION" = "Якщо у вас все ще є пропатчений інсталяційний USB, ми можемо пропустити безліч складнощів. Наполегливо рекомендується завжди мати при собі інсталяційний USB-накопичувач останньої версії macOS, тому, якщо ви хочете зробити його зараз, натисніть кнопку «Назад» у правому верхньому куті екрану, потім натисніть «Створити інсталятор» і дотримуйтесь інструкцій, потім поверніться сюди.";
"PO-NV-CHECK-ONE" = "У мене є пропатчений інсталяційний USB.";
"PO-NV-CHECK-TWO" = "У мене його немає.";
"PO-NV-ONE-TITLE" = "Відновити значення (з інсталятором)";
"PO-NV-ONE-CONTENT" = "Оскільки у вас є інсталяційний USB, це буде дуже просто і безболісно!\n1. Вимкніть Mac і знову увімкніть його, затиснувши кнопку Option.\n2. Переконайтеся, що інсталяційний USB підключений, оберіть фіолетовий завантажувальний диск EFI.\n3. Ваш Mac негайно вимкнеться, так що просто ввімкніть його знову, і все готово!";
"PO-NV-TWO-TITLE" = "Відновити значення (без інсталятора)";
"PO-NV-TWO-CONTENT" = "Оскільки у вас немає інсталяційного USB, це буде трохи складніше, але не хвилюйтеся, це буде легко. Якщо хочете, можете записати це, так як Patched Sur не зможе вам допомогти під час процесу.\n\n1. Вимкніть Mac, а потім знову увімкніть його, утримуючи CMD-OPTION-R (навіть якщо ви пропатчили режим відновлення, для цього вам все одно буде потрібно відновлення через Інтернет).\n2. Підключіться до Wi-Fi і дайте йому завантажитися.\n3. Клацніть «Утиліти» в рядку меню, потім клацніть «Термінал».\n4. Введіть nvram boot-args = -no_compat_check і натисніть клавішу ENTER.\n5. Перезавантажте Mac, і все буде готово.";
"PO-NV-BAR-TITLE" = "Проблема NVRAM";
"PO-NV-BAR-SUBTITLE" = "Давайте це виправимо.";
"PO-NV-NOUP-TITLE" = "Неможливо оновитися без необхідного значення в NVRAM";
"PO-NV-NOUP-CONTENT" = "Під час оновлення macOS видаляється патч boot.plist, який використовується в Patched Sur, щоб ви могли завантажувати Mac без -no_compat_check. Наразі це значення відсутнє, тому при оновленні ваш Mac більше не зможе завантажитися. Як тільки ви відновите це значення, ви зможете оновити систему. Для цього натисніть червону кнопку внизу вікна.";
